---
kind: property
id: P:Autodesk.Revit.DB.RevolvedFace.Curve
zh: 曲线
source: html/c0ddd4cb-7d90-3f73-aae4-1ab637fdea97.htm
---
# Autodesk.Revit.DB.RevolvedFace.Curve Property

**中文**: 曲线

Profile curve of the surface.

## Syntax (C#)
```csharp
public Curve Curve { get; }
```